[
    {
        "Quesion": "Why UX/UI?",
        "answer": "Without a strategically designed UX/UI, brands fail to engage customers online. So, UX/UI design is essential for your digital product to succeed."
    },
    {
        "Quesion": "How do we design?",
        "answer": "After learning client requirements, our dedicated UX/UI design team conducts extensive research on competitors and customers. Then the data is curated for a custom design that helps us build the prototype. The entire process is highly dependent on the feedback from clients and end-users. Such an extensive process helps us design and deliver a successful product."
    },
    {
        "Quesion": "How much does it cost?",
        "answer": "It depends on your requirements. But we make sure that the design is worth every penny you spend. Contact our team to learn about the cost."
    },
    {
        "Quesion": "What are the tools you use for designs?",
        "answer": "There are multiple tools we use for the research, design and testing. Our team typically uses Adobe XD, Adobe Photoshop, Adobe Illustrator, InVision, Sketch, Figma etc"
    },
    {
        "Quesion": "What is needed from me to get started",
        "answer": "We kick start every project with a client meeting to properly understand the product, customer, and buyer’s persona. Throughout the research and analysis period, we gather all the details that usually includes Business goals, Target audience, Product details, Expected outcomes and KPIs of the project, Technical specifications, Existing market research data, User analytics data, Business reports"
    },
    {
        "Quesion": "How Southtech’s UX/UI Design Solution Helps?",
        "answer": "We keep our designs simple yet informative for the best user experience. By following a user-centric approach to design, our primary focus is on ensuring that the user gets a pleasant experience while using any system.All our designs are focused on the minimalistic and holistic approach. The minimalism ensures that the wireframe is equipped with features and functional elements that ease user interaction. Our UX/UI relies on keeping the interface easy to understand while overcoming the technical sophistication for ease of use."
    },
    {
        "Quesion": "Would you like to talk to us in person?",
        "answer": "Email Us: southtechgroup@.org.com"
    }
]